# St7SetBrickPropertyType

Sets the material type for the specified brick property.

long St7SetBrickPropertyType(long uID, long PropNum, long MaterialType)

Input Parameters

uID

Strand7 model file ID.

Properties – Beams, Plates and Bricks

PropNum

Brick property number.

MaterialType

One of mtIsotropic, mtOrthotropic, mtAnisotropic, mtRubber, mtSoil or mtFluid.